{
    "Name": "Shah I. Nawaaz Peerally",
    "Firm": "Shah Peerally Law Group PC",
    "Law School": "New College of California School of Law",
    "Bar Admissions": "California",
    "Description": "\n        The Shah Peerally Law Group is a leading full-service US immigration law firm headquartered in Newark, California, in the heart of the San Francisco Bay Area, serving clients nationwide. The law firm is led by  Shah Peerally, Esq. Based on experience, professional achievements, and industry recognition, we have been rated as \"superb\" by the Avvo national attorney rating service, which is the highest rating class available.   \n\n        We have assisted several skilled workers placed at Fortune 500 companies in obtaining work visas (H-1B visas), and multinational corporations bringing in intra-company transferees (L-1 visas). We are also skilled in labor certifications (PERM) and employment based green card petitions. As part of our services to employers, we advise on matters including I-9 compliance and DOL audits. We also help individuals, including political asylum seekers in removal proceedings, family-based green card applicants, and those seeking inadmissibility waivers. These are only a few of the services that we offer. Our staff is also multilingual, with members who speak French, Hindi, Urdu, Punjabi. and Arabic. \n\n        If you are seeking legal representation or advice: We recommend that you call our office at 510-742-5887 to set up a consultation. \n\n        If you are not sure you need a consultation: Send us an email, and we may review your query to see if we may help you. We also recommend that you explore our website. We provide a general overview of various types of visas and legal services in articles linked to the menu items at the bottom of this main page. We also write articles on an ongoing basis about more specific immigration topics. You can find our articles on the menu bar under “Media & Publications.” You may also tune into our radio show, the Shah Peerally Law Show, every Tuesday on AM 1170 KLOK from 11AM to noon, where we take live calls, discuss various immigration topics, and provide news on immigration. Finally, to stay up to date on immigration developments, from immigration reform to changes in filing fees, you may subscribe to our free newsletter. \n        ",
    "Address": "Shah Peerally Law Group PC 37600 Central Ct Ste 202C Newark, CA 94560 USA"
}